Autodesk.Revit.DB.StairsEditScope.Start(Autodesk.Revit.DB.ElementId)
Starts an stairs edit mode for an existing Stairs element
Remarks:
User will need to start a transaction to actually make changes to the stairs element.
StairsEditScope can only be started when there is no transaction active
Thus it does not work for commands running in automatic transaction mode.
stairsId:
The stairs element to be edited.
Returns:
ElementId of the editing stairs. It should be the same as the input stairsId
Throws Autodesk.Revit.Exceptions.ArgumentException:
It is not a Stair's id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
StairsEditScope is not permitted to start at this moment for one of the following reasons:
The document is in read-only state, or the document is currently modifiable,
or there already is a stairs edit mode active in the document.
Since:
2013